### Terraform Plan - `dev` Environment

#### Terraform Format and Style: `success`
#### Terraform Initialization: `success`
#### Terraform Validation: `success`
#### Terraform Plan: `success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # helm_release.medic will be created
  + resource "helm_release" "medic" {
      + atomic                     = true
      + chart                      = "../../../helm/medic"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "medic"
      + namespace                  = "medic"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = true
    }

  # module.elasticache.aws_elasticache_cluster.this will be created
  + resource "aws_elasticache_cluster" "this" {
      + apply_immediately          = false
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "medic-dev"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "7.1"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + ip_discovery               = (known after apply)
      + maintenance_window         = "mon:04:00-mon:05:00"
      + network_type               = (known after apply)
      + node_type                  = "cache.t3.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "default.redis7"
      + port                       = 6379
      + preferred_outpost_arn      = (known after apply)
      + replication_group_id       = (known after apply)
      + security_group_ids         = [
          + "sg-0e9f44ed8f18c3d08",
        ]
      + snapshot_retention_limit   = 0
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "medic-dev-subnet-group"
      + tags                       = {
          + "Name" = "medic-dev"
        }
      + tags_all                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev"
          + "Project"     = "medic"
        }
      + transit_encryption_enabled = (known after apply)
    }

  # module.elasticache.aws_elasticache_subnet_group.this will be created
  + resource "aws_elasticache_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "Subnet group for Medic ElastiCache Redis"
      + id          = (known after apply)
      + name        = "medic-dev-subnet-group"
      + subnet_ids  = [
          + "subnet-015236b7bbb9b8a1c",
          + "subnet-036067ac3c7a6e898",
          + "subnet-0faf72d2293694269",
        ]
      + tags        = {
          + "Name" = "medic-dev-subnet-group"
        }
      + tags_all    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-subnet-group"
          + "Project"     = "medic"
        }
      + vpc_id      = (known after apply)
    }

  # module.secrets.aws_iam_policy.secrets_access will be created
  + resource "aws_iam_policy" "secrets_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy allowing Medic to read secrets from Secrets Manager"
      + id               = (known after apply)
      + name             = "medic-dev-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:us-east-1:018143940435:secret:medic/dev/secrets-gGZX4v",
                          + "arn:aws:secretsmanager:us-east-1:018143940435:secret:medic/dev/secrets-gGZX4v:*",
                        ]
                      + Sid      = "GetSecretValue"
                    },
                  + {
                      + Action    = [
                          + "secretsmanager:ListSecrets",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "secretsmanager:ResourceTag/Environment" = "dev"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "ListSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "Name"        = "medic-dev-secrets-policy"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-secrets-policy"
          + "Project"     = "medic"
        }
    }

  # module.secrets.aws_iam_role_policy_attachment.secrets_access will be created
  + resource "aws_iam_role_policy_attachment" "secrets_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "medic-dev-secrets-role"
    }

  # module.secrets.aws_secretsmanager_secret.this will be updated in-place
  ~ resource "aws_secretsmanager_secret" "this" {
      ~ description                    = "Medic application secrets for dev environment" -> "Application secrets for Medic dev environment"
      + force_overwrite_replica_secret = false
        id                             = "arn:aws:secretsmanager:us-east-1:018143940435:secret:medic/dev/secrets"
        name                           = "medic/dev/secrets"
      + recovery_window_in_days        = 7
      ~ tags                           = {
          - "Application" = "medic" -> null
          + "Environment" = "dev"
          + "Name"        = "medic-dev-secrets"
        }
      ~ tags_all                       = {
          - "Application" = "medic" -> null
          + "ManagedBy"   = "terraform"
          + "Name"        = "medic-dev-secrets"
          + "Project"     = "medic"
            # (1 unchanged element hidden)
        }
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + elasticache_connection_string = (known after apply)
  + elasticache_endpoint          = (known after apply)
  + helm_release_name             = "medic"
  + helm_release_status           = "deployed"

```

</details>

*Pushed by: @unorig-username, Action: `pull_request`*
*Workflow: `Terraform`*